Knusper.org
#+TITLE: Knusper's Emacs configuration
#+OPTIONS: toc:4 h:4

* Configuration

Somewhat inspired by [[http://sach.ac/dotemacs][Sacha Chua's Emacs configuration]]. 

** Init file
   
   We still need an [[http://www.emacswiki.org/emacs/InitFile][Init File]] (=~/.emacs.d/init.el= or =~/.emacs=)
   that loads =org-mode=, sets up the paths for packages that we don't
   install via the package manager.
   
   #+BEGIN_SRC emacs-lisp :tangle no
     ;; ~/.emacs.d/init.el

     ;; This sets up the load path so that we can override it
     (package-initialize nil)
     (add-to-list 'load-path (expand-file-name "~/emacs-scripts/"))
     ;; org-mode
     (add-to-list 'load-path (expand-file-name "~/emacs-scripts/org-8.3.4/lisp/"))
     ;; auctex
     (add-to-list 'load-path "~/.emacs.d/site-lisp/auctex")
     (load "auctex.el" nil t t)
     (load "preview-latex.el" nil t t)

     ;; Load the rest of the packages
     (package-initialize nil)
     (setq package-enable-at-startup nil)
     (org-babel-load-file "~/dotemacs_project/Knusper.org") 
   #+END_SRC

   Here =org-babel-load-file= loads this file, then uses =org-babel-tangle=
   to extract all =emacs-lisp= code into =Knusper.el=, and finally uses
   =load-file= to load it.
  
*** Notes on org-mode installation

    - Just run ~make~
    - Version currently installed: 8.3.4

*** Notes on AucTeX installation
    
    - Download AucTeX from [[https://www.gnu.org/software/auctex/download-for-unix.html]]
    - Compile using ~./configure --prefix=$HOME/.emacs.d/site-lisp/auctex --with-lispdir=$HOME/.emacs.d/site-lisp/auctex --without-texmf-dir~
    - Version currently installed: 11.89
 
*** ☛ TODO Still missing
    - Links to github / html version of my configuration
      
** Personal Information

   #+BEGIN_SRC emacs-lisp :tangle yes
     (setq user-full-name "Edmund Christian Herenz"
           user-mail-address "cherenz@aip.de")
   #+END_SRC
** Packages
*** Package Archives

    MELPA is the king of emacs package archives.  Follow [[https://twitter.com/melpa_emacs][MELPA on Twitter]].
    
    #+BEGIN_SRC emacs-lisp :tangle yes
      (add-to-list 'package-archives '("melpa" . "http://melpa.org/packages/") t)
    #+END_SRC

*** List of packages I use

    #+BEGIN_SRC emacs-lisp :tangle yes
      (defvar my/install-packages
        '(;; appearance
          powerline
          beacon
          zenburn-theme  

          ;; fun
          xkcd
          fireplace
          tea-time
    
          ;; essential
          buffer-move
          smex
          rainbow-delimiters
          htmlize
          iedit  
          auto-complete
          ido
          writeroom-mode
    
          ;; language specific
          markdown-mode
          ;; auctex (I prefer to have always a recent stable release manuaully
          ;; installed)
    
          ;; python 
          jedi
    
          ;; org-mode (I prefer to have always a recent stable release manually
          ;; installed)
          org-bullets
        ))
    #+END_SRC

