Knusper.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-10 Fr 15:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Knusper's Emacs configuration</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Edmund Christian Herenz" />
</head>
<body>
<div id="content">
<h1 class="title">Knusper's Emacs configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline60">1. Configuration</a>
<ul>
<li><a href="#orgheadline3">1.1. Init file</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Notes on org-mode installation</a></li>
<li><a href="#orgheadline2">1.1.2. Notes on AucTeX installation</a></li>
</ul>
</li>
<li><a href="#orgheadline4">1.2. Personal Information</a></li>
<li><a href="#orgheadline31">1.3. Packages</a>
<ul>
<li><a href="#orgheadline5">1.3.1. Package Archives</a></li>
<li><a href="#orgheadline6">1.3.2. List of packages I use</a></li>
<li><a href="#orgheadline7">1.3.3. use-package - automatically download and install packages</a></li>
<li><a href="#orgheadline20">1.3.4. Packages from Melpa / Elpa</a>
<ul>
<li><a href="#orgheadline8">1.3.4.1. zenburn color theme</a></li>
<li><a href="#orgheadline9">1.3.4.2. htmlize</a></li>
<li><a href="#orgheadline10">1.3.4.3. xkcd</a></li>
<li><a href="#orgheadline11">1.3.4.4. iedit</a></li>
<li><a href="#orgheadline12">1.3.4.5. markdown-mode</a></li>
<li><a href="#orgheadline13">1.3.4.6. jedi</a></li>
<li><a href="#orgheadline14">1.3.4.7. auto-complete</a></li>
<li><a href="#orgheadline15">1.3.4.8. writeroom-mode</a></li>
<li><a href="#orgheadline16">1.3.4.9. org-bullets</a></li>
<li><a href="#orgheadline17">1.3.4.10. tea-time</a></li>
<li><a href="#orgheadline18">1.3.4.11. ebib</a></li>
<li><a href="#orgheadline19">1.3.4.12. fireplace</a></li>
</ul>
</li>
<li><a href="#orgheadline24">1.3.5. Packages not in ELPA or MELPA</a>
<ul>
<li><a href="#orgheadline21">1.3.5.1. post-mode for mutt</a></li>
<li><a href="#orgheadline22">1.3.5.2. simple-wiki</a></li>
<li><a href="#orgheadline23">1.3.5.3. wikidot mode</a></li>
</ul>
</li>
<li><a href="#orgheadline30">1.3.6. Part of emacs</a>
<ul>
<li><a href="#orgheadline25">1.3.6.1. printing</a></li>
<li><a href="#orgheadline26">1.3.6.2. uniquify</a></li>
<li><a href="#orgheadline27">1.3.6.3. Midnight Mode</a></li>
<li><a href="#orgheadline28">1.3.6.4. Abbrev-mode</a></li>
<li><a href="#orgheadline29">1.3.6.5. ido-mode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline52">1.4. User Interface</a>
<ul>
<li><a href="#orgheadline32">1.4.1. Window Configuration</a></li>
<li><a href="#orgheadline49">1.4.2. Various settings</a>
<ul>
<li><a href="#orgheadline33">1.4.2.1. move around between windows using C-S-Arrow keys (wind-move)</a></li>
<li><a href="#orgheadline34">1.4.2.2. disable &lt;menu&gt;-key</a></li>
<li><a href="#orgheadline35">1.4.2.3. disable blinking cursor</a></li>
<li><a href="#orgheadline36">1.4.2.4. disable Shift+Arrow to select text</a></li>
<li><a href="#orgheadline37">1.4.2.5. middle-click pastes at point, not at mouse position</a></li>
<li><a href="#orgheadline38">1.4.2.6. transient-mark-mode</a></li>
<li><a href="#orgheadline39">1.4.2.7. highlight matching parenthesis based on point</a></li>
<li><a href="#orgheadline40">1.4.2.8. recent files mode</a></li>
<li><a href="#orgheadline41">1.4.2.9. Bind hippie-expand to M-&lt;SPC&gt; - Peace!</a></li>
<li><a href="#orgheadline42">1.4.2.10. never truncate the lines in my buffer [DISABLED]</a></li>
<li><a href="#orgheadline43">1.4.2.11. always truncate lines, but never the mini-buffer</a></li>
<li><a href="#orgheadline44">1.4.2.12. Emacs close confirmation</a></li>
<li><a href="#orgheadline45">1.4.2.13. enable disabled command - upcase region</a></li>
<li><a href="#orgheadline46">1.4.2.14. desktop-save-mode</a></li>
<li><a href="#orgheadline47">1.4.2.15. user ibuffer insted of list-buffers</a></li>
<li><a href="#orgheadline48">1.4.2.16. eshell-stuff</a></li>
</ul>
</li>
<li><a href="#orgheadline50">1.4.3. Electric Pairs</a></li>
<li><a href="#orgheadline51">1.4.4. Move around between windows (wind-move)</a></li>
</ul>
</li>
<li><a href="#orgheadline56">1.5. Convenience functions not shipped in emacs</a>
<ul>
<li><a href="#orgheadline53">1.5.1. Timestamps</a></li>
<li><a href="#orgheadline54">1.5.2. Count Words &amp; Characters</a></li>
<li><a href="#orgheadline55">1.5.3. Unfill Region / Unfill Paragraph</a></li>
</ul>
</li>
<li><a href="#orgheadline59">1.6. Mode-specific settings</a>
<ul>
<li><a href="#orgheadline57">1.6.1. LateX</a></li>
<li><a href="#orgheadline58">1.6.2. Org-Mode</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline60" class="outline-2">
<h2 id="orgheadline60"><span class="section-number-2">1</span> Configuration</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Somewhat inspired by <a href="http://sach.ac/dotemacs">Sacha Chua's Emacs configuration</a>.</li>

<li>Github repository for this file: <a href="https://github.com/Knusper/dotemacs_project">https://github.com/Knusper/dotemacs_project</a></li>

<li>HTML: <a href="http://fortune-teller-amy-88756.netlify.com/Knusper.html">http://fortune-teller-amy-88756.netlify.com/Knusper.html</a></li>

<li>Org: <a href="http://fortune-teller-amy-88756.netlify.com/Knusper.org">http://fortune-teller-amy-88756.netlify.com/Knusper.org</a></li>

<li>.el: <a href="http://fortune-teller-amy-88756.netlify.com/Knusper.el">http://fortune-teller-amy-88756.netlify.com/Knusper.el</a></li>
</ul>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.1</span> Init file</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We still need an <a href="http://www.emacswiki.org/emacs/InitFile">Init File</a> (<code>~/.emacs.d/init.el</code> or <code>~/.emacs</code>)
that loads <code>org-mode</code>, sets up the paths for packages that we don't
install via the package manager.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">~/.emacs.d/init.el</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">This sets up the load path so that we can override it</span>
(package-initialize nil)
(add-to-list 'load-path (expand-file-name <span style="color: #CC9393;">"~/emacs-scripts/"</span>))
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">org-mode</span>
(add-to-list 'load-path (expand-file-name <span style="color: #CC9393;">"~/emacs-scripts/org-8.3.4/lisp/"</span>))
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">auctex</span>
(add-to-list 'load-path <span style="color: #CC9393;">"~/.emacs.d/site-lisp/auctex"</span>)
(load <span style="color: #CC9393;">"auctex.el"</span> nil t t)
(load <span style="color: #CC9393;">"preview-latex.el"</span> nil t t)

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Load the rest of the packages</span>
(package-initialize nil)
(setq package-enable-at-startup nil)
(org-babel-load-file <span style="color: #CC9393;">"~/dotemacs_project/Knusper.org"</span>)
</pre>
</div>

<p>
Here <code>org-babel-load-file</code> loads this file, then uses <code>org-babel-tangle</code>
to extract all <code>emacs-lisp</code> code into <code>Knusper.el</code>, and finally uses
<code>load-file</code> to load it.
</p>
</div>

<div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Notes on org-mode installation</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Just run <code>make</code></li>
<li>Version currently installed: 8.3.4</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> Notes on AucTeX installation</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Download AucTeX from <a href="https://www.gnu.org/software/auctex/download-for-unix.html">https://www.gnu.org/software/auctex/download-for-unix.html</a></li>
<li>Compile using <code>./configure --prefix=$HOME/.emacs.d/site-lisp/auctex --with-lispdir=$HOME/.emacs.d/site-lisp/auctex --without-texmf-dir</code></li>
<li>Version currently installed: 11.89</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">1.2</span> Personal Information</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq user-full-name <span style="color: #CC9393;">"Edmund Christian Herenz"</span>
      user-mail-address <span style="color: #CC9393;">"cherenz@aip.de"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">1.3</span> Packages</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.3.1</span> Package Archives</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
MELPA is the king of emacs package archives.  Follow <a href="https://twitter.com/melpa_emacs">MELPA on Twitter</a>.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'package-archives '(<span style="color: #CC9393;">"melpa"</span> . <span style="color: #CC9393;">"http://melpa.org/packages/"</span>) t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">1.3.2</span> List of packages I use</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">my/install-packages</span>
  '(<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">appearance</span>
    powerline
    beacon
    zenburn-theme  

    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">fun</span>
    xkcd
    fireplace
    tea-time

    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">essential</span>
    buffer-move
    smex
    rainbow-delimiters
    htmlize
    iedit  
    auto-complete
    ido
    writeroom-mode

    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">language specific</span>
    markdown-mode
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">auctex (I prefer to have always a recent stable release manuaully</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">installed)</span>

    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">python </span>
    jedi

    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">org-mode (I prefer to have always a recent stable release manually</span>
    <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">installed)</span>
    org-bullets
  ))
</pre>
</div>
</div>
</div>
