Knusper.org
*** use-package - automatically download and install packages

    We use [[https://github.com/jwiegley/use-package][=use-package=]] to automatically download and install packages,
    if they are not present on the system.  Of course, when firing up
    EMACS for the first time on a fresh system, =use-package= needs to be
    automagically installed first.

    #+BEGIN_SRC emacs-lisp :tangle yes
      (if (not (package-installed-p 'use-package))
          (progn
            (package-refresh-contents)
            (package-install 'use-package)))

      (require 'use-package)
    #+END_SRC

    Now install packages, if not on system:

    #+BEGIN_SRC emacs-lisp :tangle yes
      (defvar packages-refreshed? nil)

      (dolist (pack my/install-packages)
        (unless (package-installed-p pack)
          (unless packages-refreshed?
            (package-refresh-contents)
            (setq packages-refreshed? t))
          (package-install pack)))    
    #+END_SRC

    (via http://writequit.org/org/settings.html)

*** Packages from Melpa / Elpa
**** zenburn color theme
     
     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package zenburn-theme
         :ensure t
         :config
         (load-theme 'zenburn))
     #+END_SRC
     
**** htmlize
     
     http://www.emacswiki.org/emacs/Htmlize

     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package htmlize
         :ensure t)     
     #+END_SRC
     
**** xkcd

     https://github.com/vibhavp/emacs-xkcd
     
     [[http://xkcd.com/][xkcd]] reader for Emacs. Nerd on!
     
     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package xkcd
        :ensure t
        :defer t)
     #+END_SRC

**** iedit

     Simultaneously edit multiple regions in buffer.
     http://www.emacswiki.org/emacs/Iedit
     
     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package iedit
         :ensure t)
     #+END_SRC

**** markdown-mode

     http://jblevins.org/projects/markdown-mode/

     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package markdown-mode
         :ensure t
         :init (setq auto-mode-alist
                     (cons '("\\.mdml$" . markdown-mode) auto-mode-alist)))
     #+END_SRC

**** jedi 

     https://tkf.github.io/emacs-jedi/latest/
     
     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package jedi
         :ensure t
         )
     #+END_SRC

**** auto-complete

     http://auto-complete.org/

     #+BEGIN_SRC emacs-lisp 
       (use-package auto-complete
         :ensure t
         :config
         (global-auto-complete-mode t) 
         (add-hook 'python-mode-hook 'jedi:setup)
         (setq jedi:setup-keys t)
	)

     #+END_SRC

**** writeroom-mode
     
     Distraction free writing.
     https://github.com/joostkremers/writeroom-mode

     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package writeroom-mode
         :ensure t)
     #+END_SRC

**** org-bullets

     The following gold is from
     https://thraxys.wordpress.com/2016/01/14/pimp-up-your-org-agenda/

     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package org-bullets
         :ensure t
         :init
         (setq org-bullets-bullet-list
               '("◉" "◎" "⚫" "○" "►" "◇"))
         :config
         (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
         )
       (setq org-todo-keywords '((sequence "☛ TODO(t)" "|" "✔ DONE(d)")
       (sequence "⚑ WAITING(w)" "|")
       (sequence "|" "✘ CANCELED(c)")))
     #+END_SRC

**** tea-time

     With =tea-time= I never forget about the tea.  Using  [[http://movie-sounds.org/action-movie-sound-clips/the-italian-job-1969/have-a-cup-of-tea-ready][this soundbite]]
     from my favorite movie "The Italian Job".

     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package tea-time
         :ensure t
         :config
         (setq tea-time-sound "~/.sounds/tea.ogg")
         (setq tea-time-sound-command "ogg123 -q %s")
         )
     #+END_SRC

**** ebib
     
     Browse / edit BibTeX bibliographies in emacs.
     http://ebib.sourceforge.net/

     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package ebib
         :ensure t
       )
     #+END_SRC

**** fireplace
     
     It can get cold in winter. =M-x fireplace=
     https://github.com/johanvts/emacs-fireplace

*** Packages not in ELPA or MELPA
    
    These packages are in =~/emacs-scripts/= as specfied in the
    load-path in [[Init file]].

