Knusper.html

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">1.3.3</span> use-package - automatically download and install packages</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
We use <a href="https://github.com/jwiegley/use-package"><code>use-package</code></a> to automatically download and install packages,
if they are not present on the system.  Of course, when firing up
EMACS for the first time on a fresh system, <code>use-package</code> needs to be
automagically installed first.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">if</span> (not (package-installed-p 'use-package))
    (<span style="color: #F0DFAF; font-weight: bold;">progn</span>
      (package-refresh-contents)
      (package-install 'use-package)))

(<span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">use-package</span>)
</pre>
</div>

<p>
Now install packages, if not on system:
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">packages-refreshed?</span> nil)

(<span style="color: #F0DFAF; font-weight: bold;">dolist</span> (pack my/install-packages)
  (<span style="color: #F0DFAF; font-weight: bold;">unless</span> (package-installed-p pack)
    (<span style="color: #F0DFAF; font-weight: bold;">unless</span> packages-refreshed?
      (package-refresh-contents)
      (setq packages-refreshed? t))
    (package-install pack)))
</pre>
</div>

<p>
(via <a href="http://writequit.org/org/settings.html">http://writequit.org/org/settings.html</a>)
</p>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">1.3.4</span> Packages from Melpa / Elpa</h4>
<div class="outline-text-4" id="text-1-3-4">
</div><div id="outline-container-orgheadline8" class="outline-5">
<h5 id="orgheadline8"><span class="section-number-5">1.3.4.1</span> zenburn color theme</h5>
<div class="outline-text-5" id="text-1-3-4-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">zenburn-theme</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  (load-theme 'zenburn))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-5">
<h5 id="orgheadline9"><span class="section-number-5">1.3.4.2</span> htmlize</h5>
<div class="outline-text-5" id="text-1-3-4-2">
<p>
<a href="http://www.emacswiki.org/emacs/Htmlize">http://www.emacswiki.org/emacs/Htmlize</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">htmlize</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-5">
<h5 id="orgheadline10"><span class="section-number-5">1.3.4.3</span> xkcd</h5>
<div class="outline-text-5" id="text-1-3-4-3">
<p>
<a href="https://github.com/vibhavp/emacs-xkcd">https://github.com/vibhavp/emacs-xkcd</a>
</p>

<p>
<a href="http://xkcd.com/">xkcd</a> reader for Emacs. Nerd on!
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">xkcd</span>
 <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
 <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-5">
<h5 id="orgheadline11"><span class="section-number-5">1.3.4.4</span> iedit</h5>
<div class="outline-text-5" id="text-1-3-4-4">
<p>
Simultaneously edit multiple regions in buffer.
<a href="http://www.emacswiki.org/emacs/Iedit">http://www.emacswiki.org/emacs/Iedit</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">iedit</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-5">
<h5 id="orgheadline12"><span class="section-number-5">1.3.4.5</span> markdown-mode</h5>
<div class="outline-text-5" id="text-1-3-4-5">
<p>
<a href="http://jblevins.org/projects/markdown-mode/">http://jblevins.org/projects/markdown-mode/</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">markdown-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> (setq auto-mode-alist
              (cons '(<span style="color: #CC9393;">"\\.mdml$"</span> . markdown-mode) auto-mode-alist)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-5">
<h5 id="orgheadline13"><span class="section-number-5">1.3.4.6</span> jedi</h5>
<div class="outline-text-5" id="text-1-3-4-6">
<p>
<a href="https://tkf.github.io/emacs-jedi/latest/">https://tkf.github.io/emacs-jedi/latest/</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">jedi</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-5">
<h5 id="orgheadline14"><span class="section-number-5">1.3.4.7</span> auto-complete</h5>
<div class="outline-text-5" id="text-1-3-4-7">
<p>
<a href="http://auto-complete.org/">http://auto-complete.org/</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">auto-complete</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  (global-auto-complete-mode t) 
  (add-hook 'python-mode-hook 'jedi:setup)
  (setq jedi:setup-keys t)
 )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-5">
<h5 id="orgheadline15"><span class="section-number-5">1.3.4.8</span> writeroom-mode</h5>
<div class="outline-text-5" id="text-1-3-4-8">
<p>
Distraction free writing.
<a href="https://github.com/joostkremers/writeroom-mode">https://github.com/joostkremers/writeroom-mode</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">writeroom-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-5">
<h5 id="orgheadline16"><span class="section-number-5">1.3.4.9</span> org-bullets</h5>
<div class="outline-text-5" id="text-1-3-4-9">
<p>
The following gold is from
<a href="https://thraxys.wordpress.com/2016/01/14/pimp-up-your-org-agenda/">https://thraxys.wordpress.com/2016/01/14/pimp-up-your-org-agenda/</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">org-bullets</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  (setq org-bullets-bullet-list
        '(<span style="color: #CC9393;">"&#9673;"</span> <span style="color: #CC9393;">"&#9678;"</span> <span style="color: #CC9393;">"&#9899;"</span> <span style="color: #CC9393;">"&#9675;"</span> <span style="color: #CC9393;">"&#9658;"</span> <span style="color: #CC9393;">"&#9671;"</span>))
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  (add-hook 'org-mode-hook (<span style="color: #F0DFAF; font-weight: bold;">lambda</span> () (org-bullets-mode 1)))
  )
(setq org-todo-keywords '((sequence <span style="color: #CC9393;">"&#9755; TODO(t)"</span> <span style="color: #CC9393;">"|"</span> <span style="color: #CC9393;">"&#10004; DONE(d)"</span>)
(sequence <span style="color: #CC9393;">"&#9873; WAITING(w)"</span> <span style="color: #CC9393;">"|"</span>)
(sequence <span style="color: #CC9393;">"|"</span> <span style="color: #CC9393;">"&#10008; CANCELED(c)"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-5">
<h5 id="orgheadline17"><span class="section-number-5">1.3.4.10</span> tea-time</h5>
<div class="outline-text-5" id="text-1-3-4-10">
<p>
With <code>tea-time</code> I never forget about the tea.  Using  <a href="http://movie-sounds.org/action-movie-sound-clips/the-italian-job-1969/have-a-cup-of-tea-ready">this soundbite</a>
from my favorite movie "The Italian Job".
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">tea-time</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  (setq tea-time-sound <span style="color: #CC9393;">"~/.sounds/tea.ogg"</span>)
  (setq tea-time-sound-command <span style="color: #CC9393;">"ogg123 -q %s"</span>)
  )
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-5">
<h5 id="orgheadline18"><span class="section-number-5">1.3.4.11</span> ebib</h5>
<div class="outline-text-5" id="text-1-3-4-11">
<p>
Browse / edit BibTeX bibliographies in emacs.
<a href="http://ebib.sourceforge.net/">http://ebib.sourceforge.net/</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">ebib</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline19" class="outline-5">
<h5 id="orgheadline19"><span class="section-number-5">1.3.4.12</span> fireplace</h5>
<div class="outline-text-5" id="text-1-3-4-12">
<p>
It can get cold in winter. <code>M-x fireplace</code>
<a href="https://github.com/johanvts/emacs-fireplace">https://github.com/johanvts/emacs-fireplace</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">1.3.5</span> Packages not in ELPA or MELPA</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
These packages are in <code>~/emacs-scripts/</code> as specfied in the
load-path in <a href="#orgheadline3">1.1</a>.
</p>
</div>
