Knusper.org
**** post-mode for mutt

     http://post-mode.sourceforge.net/

     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package post)
     #+END_SRC

**** simple-wiki

     http://www.emacswiki.org/emacs/SimpleWikiMode

     #+BEGIN_SRC emacs-lisp :tangle yes
     (use-package simple-wiki)
     #+END_SRC

**** wikidot mode

     An Emacs mode for editing Wikidot markup 

     https://github.com/infochimps-customers/wikidot-mode

     #+BEGIN_SRC emacs-lisp :tangle yes
     (use-package wikidot-mode)
     #+END_SRC
*** Part of emacs
**** printing
     
     http://www.emacswiki.org/emacs/PrintingPackage
     
     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package printing
         :config
         (pr-update-menus t))
     #+END_SRC
     
**** uniquify
     
     Uniquify buffer names. 
     See e.g. [[http://trey-jackson.blogspot.cl/2008/01/emacs-tip-11-uniquify.html][here]] or [[http://www.emacswiki.org/emacs/uniquify][here.]]

     #+BEGIN_SRC emacs-lisp :tangle yes
        (require 'uniquify)
     #+END_SRC
**** Midnight Mode 

     http://www.emacswiki.org/emacs/MidnightMode

     Bury unused buffers after some time (4:30 in the morning).
     
     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package midnight
         :config
         (midnight-delay-set 'midnight-delay "4:30am"))
     #+END_SRC
**** Abbrev-mode
     
     http://www.emacswiki.org/emacs/AbbrevMode
     - but currently not used 
     
     #+BEGIN_SRC emacs-lisp :tangle no
       (if (file-exists-p abbrev-file-name)
           (quietly-read-abbrev-file))
       (setq save-abbrevs t)  
       ;; in org-mode, we want expansions with trailing or leading slashes -
       ;; this might need some modification
       (abbrev-table-put org-mode-abbrev-table :regexp "\\(\\\\[a-z0-9@]+\\)")
     #+END_SRC

**** ido-mode

     http://www.emacswiki.org/emacs/InteractivelyDoThings
     Part of Emacs

     #+BEGIN_SRC emacs-lisp :tangle yes
       (use-package ido
         :ensure t
         :config
         (ido-mode t)
         (setq ido-enable-flex-matching t)
         (setq ido-everywhere t)
         (setq ido-max-prospects 50)
         (setq ido-max-window-height 0.25)
         )
     #+END_SRC


** User Interface
*** Window Configuration

    - no tooltips
    - no toolbar
    - menu yes
    - scroll-bars yes
  
    #+BEGIN_SRC emacs-lisp :tangle yes
      (when window-system
        (tooltip-mode -1)
        (tool-bar-mode -1)
        (menu-bar-mode 1)
        (scroll-bar-mode 1))
    #+END_SRC

*** Various settings
**** move around between windows using C-S-Arrow keys (wind-move)
     #+BEGIN_SRC emacs-lisp :tangle yes
       (global-set-key (kbd "<C-S-up>")     'windmove-up)
       (global-set-key (kbd "<C-S-down>")   'windmove-down)
       (global-set-key (kbd "<C-S-left>")   'windmove-left)
       (global-set-key (kbd "<C-S-right>")  'windmove-right)

     #+END_SRC
**** disable <menu>-key
     #+BEGIN_SRC emacs-lisp :tangle yes
       (global-set-key (kbd "<menu>") 'nil)
     #+END_SRC

**** disable blinking cursor
     #+BEGIN_SRC emacs-lisp :tangle yes
       (blink-cursor-mode 0)
     #+END_SRC

**** disable Shift+Arrow to select text
     #+BEGIN_SRC emacs-lisp :tangle yes
       (setq shift-select-mode nil)
     #+END_SRC

**** middle-click pastes at point, not at mouse position
     #+BEGIN_SRC emacs-lisp :tangle yes
       (setq mouse-yank-at-point t) 
     #+END_SRC

**** transient-mark-mode
      #+BEGIN_SRC emacs-lisp :tangle yes
       (setq transient-mark-mode t)
     #+END_SRC

**** highlight matching parenthesis based on point
     #+BEGIN_SRC emacs-lisp :tangle yes
       (show-paren-mode t)
     #+END_SRC

**** recent files mode
     #+BEGIN_SRC emacs-lisp :tangle yes
       (recentf-mode 1)
     #+END_SRC

**** Bind hippie-expand to M-<SPC> - Peace!
     #+BEGIN_SRC emacs-lisp :tangle yes
       (global-set-key "\M- " 'hippie-expand)
     #+END_SRC

**** never truncate the lines in my buffer [DISABLED]
     #+BEGIN_SRC emacs-lisp :tangle no
       (setq truncate-lines t)
     #+END_SRC

**** always truncate lines, but never the mini-buffer

     #+BEGIN_SRC emacs-lisp :tangle yes
       (setq truncate-lines t)
       (add-hook 'minibuffer-setup-hook
	     (lambda () (setq truncate-lines nil)))
     #+END_SRC

