Knusper.html

<div id="outline-container-orgheadline21" class="outline-5">
<h5 id="orgheadline21"><span class="section-number-5">1.3.5.1</span> post-mode for mutt</h5>
<div class="outline-text-5" id="text-1-3-5-1">
<p>
<a href="http://post-mode.sourceforge.net/">http://post-mode.sourceforge.net/</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">post</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-5">
<h5 id="orgheadline22"><span class="section-number-5">1.3.5.2</span> simple-wiki</h5>
<div class="outline-text-5" id="text-1-3-5-2">
<p>
<a href="http://www.emacswiki.org/emacs/SimpleWikiMode">http://www.emacswiki.org/emacs/SimpleWikiMode</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">simple-wiki</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-5">
<h5 id="orgheadline23"><span class="section-number-5">1.3.5.3</span> wikidot mode</h5>
<div class="outline-text-5" id="text-1-3-5-3">
<p>
An Emacs mode for editing Wikidot markup 
</p>

<p>
<a href="https://github.com/infochimps-customers/wikidot-mode">https://github.com/infochimps-customers/wikidot-mode</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">wikidot-mode</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">1.3.6</span> Part of emacs</h4>
<div class="outline-text-4" id="text-1-3-6">
</div><div id="outline-container-orgheadline25" class="outline-5">
<h5 id="orgheadline25"><span class="section-number-5">1.3.6.1</span> printing</h5>
<div class="outline-text-5" id="text-1-3-6-1">
<p>
<a href="http://www.emacswiki.org/emacs/PrintingPackage">http://www.emacswiki.org/emacs/PrintingPackage</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">printing</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  (pr-update-menus t))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-5">
<h5 id="orgheadline26"><span class="section-number-5">1.3.6.2</span> uniquify</h5>
<div class="outline-text-5" id="text-1-3-6-2">
<p>
Uniquify buffer names. 
See e.g. <a href="http://trey-jackson.blogspot.cl/2008/01/emacs-tip-11-uniquify.html">here</a> or <a href="http://www.emacswiki.org/emacs/uniquify">here.</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">uniquify</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-5">
<h5 id="orgheadline27"><span class="section-number-5">1.3.6.3</span> Midnight Mode</h5>
<div class="outline-text-5" id="text-1-3-6-3">
<p>
<a href="http://www.emacswiki.org/emacs/MidnightMode">http://www.emacswiki.org/emacs/MidnightMode</a>
</p>

<p>
Bury unused buffers after some time (4:30 in the morning).
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">midnight</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  (midnight-delay-set 'midnight-delay <span style="color: #CC9393;">"4:30am"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-5">
<h5 id="orgheadline28"><span class="section-number-5">1.3.6.4</span> Abbrev-mode</h5>
<div class="outline-text-5" id="text-1-3-6-4">
<p>
<a href="http://www.emacswiki.org/emacs/AbbrevMode">http://www.emacswiki.org/emacs/AbbrevMode</a>
</p>
<ul class="org-ul">
<li>but currently not used</li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">if</span> (file-exists-p abbrev-file-name)
    (quietly-read-abbrev-file))
(setq save-abbrevs t)  
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">in org-mode, we want expansions with trailing or leading slashes -</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">this might need some modification</span>
(abbrev-table-put org-mode-abbrev-table <span style="color: #DCDCCC; font-weight: bold;">:regexp</span> <span style="color: #CC9393;">"</span><span style="color: #7F9F7F; font-weight: bold;">\\</span><span style="color: #F0DFAF; font-weight: bold;">(</span><span style="color: #CC9393;">\\\\[</span><span style="color: #BFEBBF;">a-z0-9@</span><span style="color: #CC9393;">]+</span><span style="color: #7F9F7F; font-weight: bold;">\\</span><span style="color: #F0DFAF; font-weight: bold;">)</span><span style="color: #CC9393;">"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-5">
<h5 id="orgheadline29"><span class="section-number-5">1.3.6.5</span> ido-mode</h5>
<div class="outline-text-5" id="text-1-3-6-5">
<p>
<a href="http://www.emacswiki.org/emacs/InteractivelyDoThings">http://www.emacswiki.org/emacs/InteractivelyDoThings</a>
Part of Emacs
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">ido</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  (ido-mode t)
  (setq ido-enable-flex-matching t)
  (setq ido-everywhere t)
  (setq ido-max-prospects 50)
  (setq ido-max-window-height 0.25)
  )
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline52" class="outline-3">
<h3 id="orgheadline52"><span class="section-number-3">1.4</span> User Interface</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-orgheadline32" class="outline-4">
<h4 id="orgheadline32"><span class="section-number-4">1.4.1</span> Window Configuration</h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li>no tooltips</li>
<li>no toolbar</li>
<li>menu yes</li>
<li>scroll-bars yes</li>
</ul>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">when</span> window-system
  (tooltip-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode 1)
  (scroll-bar-mode 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline49" class="outline-4">
<h4 id="orgheadline49"><span class="section-number-4">1.4.2</span> Various settings</h4>
<div class="outline-text-4" id="text-1-4-2">
</div><div id="outline-container-orgheadline33" class="outline-5">
<h5 id="orgheadline33"><span class="section-number-5">1.4.2.1</span> move around between windows using C-S-Arrow keys (wind-move)</h5>
<div class="outline-text-5" id="text-1-4-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #CC9393;">"&lt;C-S-up&gt;"</span>)     'windmove-up)
(global-set-key (kbd <span style="color: #CC9393;">"&lt;C-S-down&gt;"</span>)   'windmove-down)
(global-set-key (kbd <span style="color: #CC9393;">"&lt;C-S-left&gt;"</span>)   'windmove-left)
(global-set-key (kbd <span style="color: #CC9393;">"&lt;C-S-right&gt;"</span>)  'windmove-right)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline34" class="outline-5">
<h5 id="orgheadline34"><span class="section-number-5">1.4.2.2</span> disable &lt;menu&gt;-key</h5>
<div class="outline-text-5" id="text-1-4-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #CC9393;">"&lt;menu&gt;"</span>) 'nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline35" class="outline-5">
<h5 id="orgheadline35"><span class="section-number-5">1.4.2.3</span> disable blinking cursor</h5>
<div class="outline-text-5" id="text-1-4-2-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(blink-cursor-mode 0)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline36" class="outline-5">
<h5 id="orgheadline36"><span class="section-number-5">1.4.2.4</span> disable Shift+Arrow to select text</h5>
<div class="outline-text-5" id="text-1-4-2-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq shift-select-mode nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline37" class="outline-5">
<h5 id="orgheadline37"><span class="section-number-5">1.4.2.5</span> middle-click pastes at point, not at mouse position</h5>
<div class="outline-text-5" id="text-1-4-2-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq mouse-yank-at-point t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline38" class="outline-5">
<h5 id="orgheadline38"><span class="section-number-5">1.4.2.6</span> transient-mark-mode</h5>
<div class="outline-text-5" id="text-1-4-2-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq transient-mark-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline39" class="outline-5">
<h5 id="orgheadline39"><span class="section-number-5">1.4.2.7</span> highlight matching parenthesis based on point</h5>
<div class="outline-text-5" id="text-1-4-2-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(show-paren-mode t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline40" class="outline-5">
<h5 id="orgheadline40"><span class="section-number-5">1.4.2.8</span> recent files mode</h5>
<div class="outline-text-5" id="text-1-4-2-8">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(recentf-mode 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline41" class="outline-5">
<h5 id="orgheadline41"><span class="section-number-5">1.4.2.9</span> Bind hippie-expand to M-&lt;SPC&gt; - Peace!</h5>
<div class="outline-text-5" id="text-1-4-2-9">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key <span style="color: #CC9393;">"\M- "</span> 'hippie-expand)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline42" class="outline-5">
<h5 id="orgheadline42"><span class="section-number-5">1.4.2.10</span> never truncate the lines in my buffer [DISABLED]</h5>
<div class="outline-text-5" id="text-1-4-2-10">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq truncate-lines t)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline43" class="outline-5">
<h5 id="orgheadline43"><span class="section-number-5">1.4.2.11</span> always truncate lines, but never the mini-buffer</h5>
<div class="outline-text-5" id="text-1-4-2-11">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq truncate-lines t)
(add-hook 'minibuffer-setup-hook
      (<span style="color: #F0DFAF; font-weight: bold;">lambda</span> () (setq truncate-lines nil)))
</pre>
</div>
</div>
</div>
