Knusper.html

<div id="outline-container-orgheadline44" class="outline-5">
<h5 id="orgheadline44"><span class="section-number-5">1.4.2.12</span> Emacs close confirmation</h5>
<div class="outline-text-5" id="text-1-4-2-12">
<p>
(do not accidentally close emacs)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq kill-emacs-query-functions
      (cons (<span style="color: #F0DFAF; font-weight: bold;">lambda</span> () (yes-or-no-p <span style="color: #CC9393;">"Really Quit Emacs? "</span>))
            kill-emacs-query-functions))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline45" class="outline-5">
<h5 id="orgheadline45"><span class="section-number-5">1.4.2.13</span> enable disabled command - upcase region</h5>
<div class="outline-text-5" id="text-1-4-2-13">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(put 'upcase-region 'disabled nil)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline46" class="outline-5">
<h5 id="orgheadline46"><span class="section-number-5">1.4.2.14</span> desktop-save-mode</h5>
<div class="outline-text-5" id="text-1-4-2-14">
<p>
(see Sect. 42 "Saving Emacs Sessions" in Emacs
User Manual)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(desktop-save-mode 1)
(setq desktop-restore-eager 10)
(setq desktop-save t) <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">save without asking</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline47" class="outline-5">
<h5 id="orgheadline47"><span class="section-number-5">1.4.2.15</span> user ibuffer insted of list-buffers</h5>
<div class="outline-text-5" id="text-1-4-2-15">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">defalias</span> '<span style="color: #93E0E3;">list-buffers</span> 'ibuffer)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline48" class="outline-5">
<h5 id="orgheadline48"><span class="section-number-5">1.4.2.16</span> eshell-stuff</h5>
<div class="outline-text-5" id="text-1-4-2-16">
<p>
em-joc - not used anymore
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"> (<span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">em-joc</span>)
  (<span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">eshell/info</span> (subject)
    <span style="color: #9FC59F;">"Read the Info manual on SUBJECT."</span>
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> ((buf (current-buffer)))
      (Info-directory)
      (<span style="color: #F0DFAF; font-weight: bold;">let</span> ((node-exists (<span style="color: #F0DFAF; font-weight: bold;">ignore-errors</span> (Info-menu subject))))
        (<span style="color: #F0DFAF; font-weight: bold;">if</span> node-exists
            0
<span style="color: #5F7F5F;">;;          </span><span style="color: #7F9F7F;">We want to switch back to *eshell* if the requested</span>
<span style="color: #5F7F5F;">;;          </span><span style="color: #7F9F7F;">Info manual doesn't exist.</span>
          (switch-to-buffer buf)
          (eshell-print (format <span style="color: #CC9393;">"There is no Info manual on %s.\n"</span>
                                subject))
          1))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline50" class="outline-4">
<h4 id="orgheadline50"><span class="section-number-4">1.4.3</span> Electric Pairs</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(electric-pair-mode 1)
(<span style="color: #F0DFAF; font-weight: bold;">defvar</span> <span style="color: #DFAF8F;">markdown-electric-pairs</span> '((?* . ?*)) <span style="color: #9FC59F;">"Electric pairs for markdown-mode."</span>)
(<span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">markdown-add-electric-pairs</span> ()
  (setq-local electric-pair-pairs (append electric-pair-pairs markdown-electric-pairs))
  (setq-local electric-pair-text-pairs electric-pair-pairs))
(add-hook 'markdown-mode-hook 'markdown-add-electric-pairs)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline51" class="outline-4">
<h4 id="orgheadline51"><span class="section-number-4">1.4.4</span> Move around between windows (wind-move)</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Move around between windows using C-S-Arrow keys (wind-move). Better
than pressing repeatedly C-x o. (Seems not to work in org-mode?)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="color: #CC9393;">"&lt;C-S-up&gt;"</span>)     'windmove-up)
(global-set-key (kbd <span style="color: #CC9393;">"&lt;C-S-down&gt;"</span>)   'windmove-down)
(global-set-key (kbd <span style="color: #CC9393;">"&lt;C-S-left&gt;"</span>)   'windmove-left)
(global-set-key (kbd <span style="color: #CC9393;">"&lt;C-S-right&gt;"</span>)  'windmove-right)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">1.5</span> Convenience functions not shipped in emacs</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-orgheadline53" class="outline-4">
<h4 id="orgheadline53"><span class="section-number-4">1.5.1</span> Timestamps</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Command to insert timestamps into text - e.g.: 27.10.2015, 12:25
Inspired from <a href="http://emacswiki.org/emacs/InsertingTodaysDate">http://emacswiki.org/emacs/InsertingTodaysDate</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">timestamp</span> ()
  (interactive)
  (insert (format-time-string <span style="color: #CC9393;">"%d.%m.%Y, %H:%M"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline54" class="outline-4">
<h4 id="orgheadline54"><span class="section-number-4">1.5.2</span> Count Words &amp; Characters</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
From <a href="http://ergoemacs.org/emacs/elisp_count-region.html">http://ergoemacs.org/emacs/elisp_count-region.html</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">my-count-words-region</span> (posBegin posEnd)
  <span style="color: #9FC59F;">"Print number of words and chars in region."</span>
  (interactive <span style="color: #CC9393;">"r"</span>)
  (message <span style="color: #CC9393;">"Counting &#8230;"</span>)
  (<span style="color: #F0DFAF; font-weight: bold;">save-excursion</span>
    (<span style="color: #F0DFAF; font-weight: bold;">let</span> (wordCount charCount)
      (setq wordCount 0)
      (setq charCount (- posEnd posBegin))
      (goto-char posBegin)
      (<span style="color: #F0DFAF; font-weight: bold;">while</span> (and (&lt; (point) posEnd)
                  (re-search-forward <span style="color: #CC9393;">"\\w+\\W*"</span> posEnd t))
        (setq wordCount (1+ wordCount)))

      (message <span style="color: #CC9393;">"Words: %d. Chars: %d."</span> wordCount charCount)
      )))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline55" class="outline-4">
<h4 id="orgheadline55"><span class="section-number-4">1.5.3</span> Unfill Region / Unfill Paragraph</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Source: <a href="http://ergoemacs.org/emacs/emacs_unfill-paragraph.html">http://ergoemacs.org/emacs/emacs_unfill-paragraph.html</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">unfill-paragraph</span> ()
  <span style="color: #9FC59F;">"Replace newline chars in current paragraph by single spaces.</span>
<span style="color: #9FC59F;">This command does the inverse of `</span><span style="color: #BFEBBF;">fill-paragraph</span><span style="color: #9FC59F;">'."</span>
  (interactive)
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> ((fill-column 90002000)) <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">90002000 is just random. you can use `</span><span style="color: #BFEBBF;">most-positive-fixnum</span><span style="color: #7F9F7F;">'</span>
    (fill-paragraph nil)))
(<span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">unfill-region</span> (start end)
  <span style="color: #9FC59F;">"Replace newline chars in region by single spaces.</span>
<span style="color: #9FC59F;">This command does the inverse of `</span><span style="color: #BFEBBF;">fill-region</span><span style="color: #9FC59F;">'."</span>
  (interactive <span style="color: #CC9393;">"r"</span>)
  (<span style="color: #F0DFAF; font-weight: bold;">let</span> ((fill-column 90002000))
    (fill-region start end)))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgheadline59" class="outline-3">
<h3 id="orgheadline59"><span class="section-number-3">1.6</span> Mode-specific settings</h3>
<div class="outline-text-3" id="text-1-6">
<p>
AucTeX + org-mode are installed manually.
</p>
</div>

<div id="outline-container-orgheadline57" class="outline-4">
<h4 id="orgheadline57"><span class="section-number-4">1.6.1</span> LateX</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq LaTeX-math-menu-unicode t)
(add-hook 'LaTeX-mode-hook 'turn-on-auto-fill)
(<span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">reftex</span>)
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)
(setq reftex-plug-into-AUCTeX t)
(setq-default TeX-master nil)
(setq reftex-cite-format 'natbib)
</pre>
</div>
</div>
</div>
